<template>
  <div>
    <!-- Хедер -->
    <ThemeSwitcher />
    <Header />
    <!-- Main content -->
    <main class="main">
      <div class="container">
        <article class="content-container">
          <header>
            <div class="content-category">МАСОНСТВО</div>
            <h1 class="content-title">Общие принципы</h1>
          </header>

          <img src="@/assets/img/principles.png" alt="Article image" class="article__image" />

          <div class="content-text">
            <div class="entry-content herald-entry-content">
              <p><span style="font-family: 'book antiqua', palatino, serif"></span></p>
              <p>
                <span
                  style="
                    font-family:
                      book antiqua,
                      palatino,
                      serif;
                    font-size: 14pt;
                  "
                  >Ниже приводится свод основополагающих принципов масонства – нравственных правил,
                  в соответствии с которыми масоны выстраивают свою деятельность в ложе и за её
                  пределами в профанском мире, самоопределение масонства, его основная цель,
                  перечень масонских нравственных ориентиров – словом, всё то, что, по нашему
                  мнению, делает масона масоном; то, к чему мы в своей повседневной деятельности
                  стремимся. Это не самый полный список: он может быть дополнен положениями,
                  перечисленными в Конституции Объединенной Великой Ложи России, а также как в её
                  Генеральном Регламенте, так и (в уточнённом или дополненном виде) в регламенте
                  конкретной ложи.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Орден Вольных Каменщиков (масонов, франкмасонов, от французского Franc-Maçon –
                  вольный каменщик) – это традиционный универсальный посвятительный Орден на основе
                  Братства.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Это союз людей свободных и добрых нравов, всех рас, всех национальностей и всех
                  вероисповеданий. Он объединяет тех, для кого сохранение и развитие духовных
                  ценностей человечества является задачей первостепенной важности.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >«Масонство» традиционно определяется как «нравственно-этическая система, скрытая
                  в аллегориях и иллюстрируемая символами». Но это, одновременно, и школа
                  Нравственности, и Этический Кодекс, и метод Познания. Это подлинно
                  <strong>«Королевское искусство»</strong>.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Цель Ордена Вольных Каменщиков, т.е. основная духовная задача, которую ставят
                  перед собой и решают Братья, формулируется как «самосовершенствование и
                  просвещение человеков для их улучшения».</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Для этого Вольные Каменщики усердно работают в Ложах, духовно совершенствуя себя,
                  подавая примеры нравственности, содействуя просвещению, и проводя широкую
                  благотворительную деятельность.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Личное духовное самосовершенствование каждого и братское единение – стержневые
                  идеи масонства. Это путь к единой вселенской Морали, построенной на идее
                  <strong>Добра</strong>. К человеческим отношениям, основанным на принципах
                  братства, любви, сотрудничества и согласия. К единой высшей
                  <strong>Мудрости</strong>, приводящей все разрозненные явления мира к высшей
                  <strong>Гармонии</strong>.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Долг духовного самосовершенствования повелевает Вольному Каменщику и в личной
                  жизни и в окружающем его мире быть мудрым, добродетельным и справедливым. Он
                  невольно становится достойным и притягательным примером для подражания.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Масонство основано на чувстве единства Жизни и Высшего Нравственного Закона.
                  Правила: «Поступай с другими так, как хотел бы, что бы поступали с тобой» и «Не
                  делай другому того, что не хотел бы, что бы делали тебе» – закон для Вольного
                  Каменщика. Братья должны неукоснительно следовать ему и в Ложе, и в мире
                  профанов.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Вольные Каменщики признают себя Братьями и должны оказывать друг другу помощь и
                  поддержку, даже в случае опасности для своей жизни. Они также обязаны оказывать
                  помощь любому человеку, подвергающемуся опасности.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >В неустанных поисках <strong>Истины</strong> и
                  <strong>Высшей Справедливости</strong> Вольные Каменщики не признают никаких
                  препятствий и ограничений.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они абсолютно привержены к уважению личности и свободы другого человека, признают
                  за каждым право на собственное мнение и его свободное изложение.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они всегда стремятся примирить противоположности и объединить людей на основе
                  всеобщей нравственности и уважения личности каждого.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они считают работу своим долгом и правом.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Вольные Каменщики обязаны уважать законы и законную власть страны, в которой они
                  живут и свободно собираются. Это просвещенные и дисциплинированные граждане, во
                  всем остальном руководствующиеся императивами своей совести.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Практикуя «Королевское искусство», они уважают традиционные правила, нравы и
                  обычаи Ордена.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Вольные Каменщики узнают друг друга по словам, знакам и лёгким прикосновениям, с
                  помощью которых они традиционно общаются в Ложе во время посвятительных
                  церемоний.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Эти слова, знаки и лёгкие прикосновения, также как обряды и символы, составляют
                  предмет нерушимой тайны и не могут сообщаться никому, кто не обладает
                  соответствующим статусом, чтобы их знать.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Каждый Вольный Каменщик волен раскрывать или не раскрывать свой статус, но он не
                  может раскрывать статус Брата.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Вольные Каменщики объединяются между собой, чтобы образовать – согласно масонской
                  традиции – автономные коллективы, именуемые Ложами.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Любая Ложа управляется согласно решениям, принимаемым большинством Мастеров
                  Вольных Каменщиков, надлежаще облаченных, но не может отойти от общих принципов
                  масонства и от законов Послушания, к которому она принадлежит.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Ложи группируются в Великие Ложи – независимые национальные структуры,
                  хранительницы традиции, осуществляющие исключительную и безраздельную юрисдикцию в
                  рамках «символического масонства», т.е. над тремя символическими градусами:
                  Ученик, Подмастерье и Мастер.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Великие Ложи управляются согласно традиции, «Древним обязательствам», а также
                  собственным Конституциям и Законам.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они уважают суверенность и независимость других масонских структур и избегают
                  любого вмешательства в их внутренние дела.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они поддерживают между собой необходимые отношения для сплочения универсального
                  Ордена.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они, по своему усмотрению, заключают между собой договоры и братские союзы, но не
                  признают никакой вышестоящей национальной или международной масонской
                  власти.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Они самостоятельно регулируют свои законодательство и управление, правосудие и
                  внутреннюю дисциплину.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"> </span>
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Так, через уважение личности каждого масонского национального образования,
                  автономии каждой Ложи и индивидуальной свободы каждого Брата, сохраняется
                  универсальность Ордена Вольных Каменщиков, дабы между всеми масонами царили
                  <strong>Любовь, Гармония и Согласие</strong>.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif"> </span>
              </p>
              <h1 class="wp-block-heading" style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 18pt"
                  >Основополагающие принципы масонства в исторической литературе были сформулированы
                  следующим образом:</span
                >
              </h1>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif"> </span>
              </p>
              <ol class="wp-block-list">
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    У масонов есть опознавательные знаки и слова.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Существуют специальные знаки, прикосновения (рукопожатия), жесты и слова,
                        специфические для каждого градуса (или степени – Ученик, Подмастерье и
                        Мастер в символическом масонстве), предназначенные для отличия, а в случае
                        когда ложу посещает не известный братьям брат другой ложи – для его проверки
                        (экзаменации для подтверждения факта того, что он получил соответствующую
                        степень для предотвращения нарушения масонской тайны градуса)
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Символическое масонство делится на три градуса.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Масонство относительно его степеней (градусов) условно разделяется на
                        символическое масонство (первые три градуса – Ученик, Подмастерье и Мастер.
                        Также можно встретить название “крафт” или “голубые степени” – по
                        преобладающему окрасу убранства ложи в первых трёх степенях), а также на
                        масонство высших степеней. Высшие степени – это надстройка над
                        символическими и здесь не рассматриваются.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Легенда о Хираме в третьем градусе.
                    <br /><em
                      ><span style="font-size: 12pt">
                        При возвышении в 3-й градус (степень Мастера масона) посвящаемый масон
                        ритуально участвует в хирамической легенде – драматичной и красивой
                        философской аллегории. И если градус Ученика можно считать рождением и
                        своеобразным “детством” масона, Утром его жизни, градус Подмастерья –
                        юностью, взрослением и Днём, то градус Мастера – это Ночь, угасание,
                        мудрость. Мастер масон – это будущий офицер ложи, с большой вероятностью
                        станущий Досточтимым Мастером ложи – её руководителем, поэтому он должен
                        испытать на себе весь драматизм Легенды о Хираме и вынести
                        философско-нравственный урок в раздумьях над проведённым над ним ритуалом
                        посвящения в Мастера.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Братством управляет Великий Мастер, избираемый из состава братьев.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Когда на территории одного государства появляется 3 и более ложи, они могут
                        организоваться (если до того не было) в свою Великую Ложу, входящую в тот
                        или иной союз Великих Лож. И если отдельные ложи можно представить как
                        отдельные группы одного курса института или университета, то, также как из
                        состава этого курса выбирается его староста, отвечающий за организационные и
                        руководящие административные вопросы (а староста отдельной группы при этом –
                        в масштабе ложи – её Досточтимый Мастер), в точности так же из состава всех
                        братьев всех лож выбирается один, по мнению братьев, самый достойный
                        руководить всем послушанием (другое название Великой Ложи) и на
                        торжественном собрании всех лож, называемым Ассамблеей, назначается на
                        должность Великого Мастера.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Великий Мастер обладает правом председательствовать на любом собрании Братства,
                    где бы и когда бы оно ни проходило.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Это одна из особых привилегий, дарованных Великому Мастеру братьями, его
                        избравшими. И в каждом случае когда Великий Мастер наносит визит одной из
                        лож своего послушания, Досточтимый Мастер при ритуальной встрече Великого
                        Мастера передаёт ему свой молоток – символ руководящей власти в Ложе. И если
                        Великий Мастер посчитает необходимым, он может принять молоток, занять место
                        руководителя Ложи и далее вести собрание Ложи до самого его завершения,
                        какая бы повестка дня ни была – от простых обсуждений жизнедеятельности Ложи
                        до посвящений в масоны и возвышений в градусы Подмастерья и Мастера.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Великий Мастер обладает властью даровать право открытия Ложи и проведения в ней
                    работ.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Смыслом этого постулата является то, что только Великий Мастер обладает
                        такой властью. Это ещё одна из нескольких привилегий, дарованных только
                        Великому Мастеру. Никто кроме него не может, согласно древним масонским
                        традициям, дать жизнь (мы говорим – “зажечь Свет”) новой Ложе.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Великий Мастер обладает правом давать разрешение на посвящение какого-либо брата
                    в какой-либо градус без соблюдения обусловленных традицией сроков.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Срок пребывания масона в определённом градусе определяется на уровне Великой
                        Ложи в Генеральном Регламенте, а этот минимальный срок может быть
                        откорректирован Регламентом той Ложи, в которой масон состоит. Однако в
                        случае необходимости, если Ложа посчитает, что брат вполне избыл срок в
                        своем градусе и усвоил урок градуса (хорошо разбирается в понятиях,
                        категориях и символизме градуса), она может попросить Великого Мастера о
                        досрочном повышении ему заработной платы (так масоны называют возвышение
                        брата в следующую степень), и такое право имеется тоже только лишь у
                        Великого Мастера.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Великий Мастер обладает правом проводить посвящение в Братство без соблюдения
                    обычной процедуры.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Трудно себе представить причину, по которой масону пришлось бы повысить
                        заработную плату минуя красивый ритуал возвышения в следующий градус. Однако
                        в масонстве предусмотрен и такой вариант развития событий. В случае
                        невозможности провести ритуал, Великий Мастер имеет право дать масону
                        следующий градус одним рукоположением.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Масоны должны собираться в Ложах.
                    <br /><em
                      ><span style="font-size: 12pt">
                        Это традиционный порядок масонских собраний. Если раньше, оперативные
                        каменщики (а оперативными мы называем древних каменотёсов, на самом деле, а
                        не символично, как современные масоны) собирались в пристройках к возводимым
                        постройкам, то теперь в качестве ложи выступает внутренняя комната или зал,
                        соответствующим образом приуготовленная.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Когда братья собираются в Ложе, ими должны руководить Досточтимый Мастер и два
                    Смотрители.
                    <br /><em
                      ><span style="font-size: 12pt">
                        У руководителя Ложи – Досточтимого Мастера – в управлении есть его
                        Заместитель (Старший Смотритель), который также получает важную задачу в
                        организации работы Ложи, а также контролирует сборы и расходные вопросы.
                        Второй Смотритель выполняет роль не менее важную – он следит за выполнением
                        работы в процессе и ставит необходимую задачу.
                      </span></em
                    >
                  </span>
                </li>
                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Во время собрания любой Ложи она должна
                    <em>соответствующим образом охраняться</em>.<br />
                  </span>
                  <span style="font-family: 'book antiqua', palatino, serif">
                    <em
                      >Эта традиция берёт свои истоки со времён становления спекулятивного
                      масонства, когда братья собирались в комнатах в тавернах, углём чертили на
                      полу табель ложи, а чтобы обезопасить собрание от подслушивающих и вообще
                      посторонних, у входа в помещение выставлялся часовой, или – Внешний
                      привратник. Эта традиция сохранилась до наших дней: в Ложе существует
                      должность Привратника, а в некоторых послушаниях, помимо него – ещё и Внешний
                      Привратник (Внешний Страж).</em
                    >
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Каждый масон имеет право на представительство в любых общих собраниях Братства,
                    а также соответствующим образом инструктировать своих представителей.<br />
                    <em>
                      Это правило относится к таким важным общим собраниям Братства, как Ассамблеи,
                      на которых собираются братья из всех Лож Великой Ложи. Сейчас такими
                      Представителями являются Депутат от Ложи и его Помощник. Ложа наделяет этих
                      братьев наказом о принятых Ложей решениях относительно принимаемых на
                      Ассамблее решений. </em
                    ><br />
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Каждый масон имеет право апеллировать по поводу решения своих братьев к Великой
                    Ложе или Всеобщей Ассамблее.<br />
                    <em>
                      Ложей общим голосованием выносится масса решений. Если какой-то масон,
                      состоящий в Ложе, посчитает принятое в Ложе решение ущемляющим его интересы, и
                      не получается разрешить вопрос внутри Ложи, он может подать апелляцию выше – в
                      Комитет Великих Офицеров – высший орган административной власти всей Великой
                      Ложи. </em
                    ><br />
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Каждый масон имеет право посещать и присутствовать на собраниях любой регулярной
                    Ложи.<br />
                    <em>
                      Это тоже традиционно верно, но отчасти: конкретная Ложа должна быть согласна
                      допустить масона на свои работы (своё собрание). Работы Ложи проводятся в
                      гармонии и согласии между братьями. Если известно, что по каким-то причинам
                      присутствие брата может нарушить гармонию в Ложе, ему в визите будет отказано.
                      Впрочем, не можем припомнить подобного в нашем послушании; наоборот, все наши
                      Ложи весьма гостеприимны к братьям-гостям из других Лож Объединенной Великой
                      Ложи России. Есть одно исключение из этого правила, касаемое Учеников: если
                      один или несколько Учеников пожелают посетить работы не своей Ложи, в таком
                      случае они должны будут прибыть на них в сопровождении одного из Мастеров
                      своей Ложи. И, конечно же, Великий Мастер или уполномоченный им Заместитель
                      либо Помощник может посетить работы любой Ложи без запроса разрешения. </em
                    ><br />
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Ни один посетитель, не известный присутствующим братьям или кому-то одному из
                    них, не имеет права входа в Ложу, пока не пройдет опрос или экзамен в
                    соответствии с древними традициями.<br />
                    <em>
                      Это правило перекликается с первым правилом Принципов масонства. Редко
                      случается, что на работы Ложи в качестве гостя прибывает никому не известный
                      масон – член другой ложи или братского послушания (Великой Ложи, с которой у
                      Великой Ложи, в которой состоит Ложа визитации, есть соглашение о Братской
                      Дружбе либо о взаимном признании, что по сути одно и то же). Чаще всего бывает
                      уже так, что с ним уже кто-то из Ложи, визит в которую он наносит, или кто-то
                      из Великих Офицеров, этого брата хорошо знает. По крайней мере информацией о
                      визите заранее обмениваются на уровне Великого Секретариата. Но даже и в этих
                      случаях Досточтимый Мастер вправе устроить проверку-экзаменацию; правда, все
                      понимают, что это, скорее, дань древней традиции. </em
                    ><br />
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Никакая Ложа не имеет права вмешиваться во внутренние дела другой Ложи или же
                    присваивать градусы братьям-членам других Лож.<br />
                    <span style="font-size: 12pt">
                      <em>
                        У масонов есть правило: твоя свобода ограничена границами свободы других
                        людей. На эти границы ты посягать не имеешь права. Это же правило
                        экстраполируется на уровень масонской ложи: как описано в положении о
                        невмешательстве, ни одна из лож не имеет права вмешиваться в дела
                        лож-соседей. Относительно второй части этого положения – каждый масон после
                        посвящения в братство “привязан” к ложе, его посвятившей (мы называем её
                        материнской ложей). Только ложа, в которой масон на данный момент состоит,
                        может присваивать масону старшие градусы. Такой порядок вещей – по
                        нескольким причинам: во-первых, в материнской ложе братья видят масонскую
                        работу брата, могут оценить насколько хорошо он разбирается в своём градусе,
                        в ложе знают, все ли причитающиеся взносы братом уплачены, и т.д.
                      </em> </span
                    ><br />
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Каждый масон обязан повиноваться масонскому законодательству своей юрисдикции
                    (по месту жительства) вне зависимости от того, состоит он в какой-либо Ложе или
                    нет.<br />
                    <span style="font-size: 12pt">
                      <em>
                        Масонство сильно своей распространённостью по миру (мы говорим – длиной
                        братской цепи). Часто случается так, что брату по работе ли, по делам,
                        связанным с масонской административной деятельностью, или просто в целях
                        отдыха – туризма (мы говорим – по профанским делам; то есть, по делам, не
                        связанным с масонством вообще никак). Если при этом брат находится на
                        территории страны, в которой находится братское послушание (не его родной
                        страны; допустим, русский масон из ОВЛР приехал в Словению или во Францию),
                        он на территории этой страны обязан соблюдать масонское законодательство
                        масонского послушания этой страны. Это законодательство в общих вопросах
                        сильно вероятно совпадает с масонским законодательством его родного
                        послушания, но бывают нюансы, и эти различия он должен знать и учитывать.
                        Ничего сложного в этом нет: перед такой поездкой российский масон уведомляет
                        Секретаря и Досточтимого Мастера своей российской ложи, Секретарь ложи –
                        уведомляет Великого Секретаря своего послушания, а последний, в свою
                        очередь, связывается с Великим Секретарём зарубежного послушания той страны,
                        куда наш брат-турист собирается поехать. Существует ряд документов (самый
                        распространённый – это масонский паспорт), необходимый для предъявления в
                        братском послушании другой страны. Великие Секретариаты братских
                        международных послушаний обмениваются этими документами перед визитами
                        иностранных братьев, и при поездке в такую страну брату по его просьбе будет
                        оказана необходимая помощь зарубежных братьев, если он вдруг столкнётся с
                        трудностями или помогут посетить собрания лож, если у нашего брата будет на
                        то желание. Перед такой повесткой Великий секретарь родного послушания
                        извещает брата о вышеописанных нюансах масонского законодательства
                        посещаемого послушания.
                      </em> </span
                    ><br />
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Кандидаты на посвящение в Братство
                    <em>должны отвечать определенным требованиям</em>.
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Вера в существование Бога, называемого «Великий Архитектор (Строитель)
                    Вселенной».
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Вера в Возрождение к Грядущей Жизни.
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Книга Священного Закона является неизменной, незаменимой и неотъемлемой частью
                    убранства любой Ложи.
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Признается равенство масонов.
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Соблюдается тайна организации.
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Основание спекулятивной (умозрительной) науки на оперативных (действенных)
                    началах.
                  </span>
                </li>

                <li style="text-align: justify">
                  <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt">
                    Символическое использование и объяснение терминов данного ремесла ради обучения
                    религиозным и нравственным принципам.
                  </span>
                </li>
              </ol>
              <p><span style="font-family: 'book antiqua', palatino, serif"></span></p>
            </div>
          </div>
        </article>
      </div>
    </main>
    <!-- Футер -->
    <Footer />
    <!-- Кнопка для прокрутки вверх -->
    <ScrollTop />
  </div>
</template>

<script setup lang="ts">
import Header from '@/components/MainHeader.vue'
import Footer from '@/components/MainFooter.vue'
import ScrollTop from '@/components/ScrollTop.vue'
import ThemeSwitcher from '@/components/ThemeSwitcher.vue'
</script>

<style scoped>
@import url('https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css');
@import url('https://fonts.googleapis.com/css2?family=Baskervville:ital@0;1&family=Montserrat:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');

@import '@/assets/css/style.css';
@import '@/assets/css/article.css';
</style>
