<template>
  <div>
    <!-- Хедер -->
    <ThemeSwitcher />
    <Header />
    <!-- Main content -->
    <main class="main">
      <div class="container">
        <article class="content-container">
          <header>
            <div class="content-category">МАСОНСТВО</div>
            <h1 class="content-title">Главные масонские символы</h1>
          </header>

          <img src="@/assets/img/symbols/header.jpg" alt="Article image" class="article__image" />

          <div class="content-text">
            <!-- Таблица с изображениями и описаниями -->
            <table class="custom-table">
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/001.jpg"
                    alt="Symbol 1"
                    class="table__image"
                    @click="openImageModal('symbols/001.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Колонны Я:. и Б:.</h3>
                  <p class="table__description">
                    Врата для посвящаемого, выход к свету для ищущего, колонны храма Иерусалимского.
                    Б:. – Северная колонна и Я:. – Южная колонна. Символические колонны напоминают
                    исписанные иероглифами обелиски, которые возвышались перед египетскими храмами.
                    Их находят и в двух округлых порталах готических соборов. Это две колонны
                    Геркулеса, указывавшие границы, между которыми индивидуальность человека
                    умирает. Масонский ритуал посвящения включает в себя предупреждение кандидату
                    перед входом в храм- “если ты держишься за человеческие отличия, уходи – здесь
                    их нет”. Северная колонна также символизирует разрушение, первозданный Хаос;
                    Южная – созидание, упорядоченность, систему, внутреннуюю взаимосвязь. Это Земля
                    и Космос, Chaos и Amber.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/002.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/002.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Ступени</h3>
                  <p class="table__description">
                    Между колоннами Храма могут изображаться ступени, которые символизируют
                    испытания и очищение стихиями при получении масонского посвящения.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/003.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/003.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Мозаичный пол</h3>
                  <p class="table__description">
                    За колоннами следует мозаичный пол с чередованием в шахматном порядке белых и
                    черных клеток. Символизм чередования белых и черных клеточек говорит о том, что
                    области наших чувств все уравновешивается со строгой точностью. Восприятие
                    складывается по законам контраста. Мы отдыхаем по мере усталости, мы ценим
                    удовольствие лишь в сопоставлении его с той же мерой страдания. Радость
                    пропорциональна горю и тоске, им предшествовавшим. Обнаружение ошибки открывает
                    истину. Добро влечет нас в той мере, в какой нас отталкивало зло. Ценность
                    выживания измеряется силой борьбы против побежденных трудностей, стоявших на
                    пути.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/004.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/004.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Резец и молот</h3>
                  <p class="table__description">
                    Для претворения в жизнь его работы ученику даются орудия – резец –
                    представляющий установившуюся мысль, принятые решения, и молот – волю приводящую
                    их в действие.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/005.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/005.jpg')"
                  />
                </td>
                <td>
                  <p class="table__description">
                    Резец указывает нам на преимущества образования, только лишь благодаря которому
                    мы превращаемся в людей, соответствующих природе нашего исправного и
                    совершенного сообщества.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/006.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/006.jpg')"
                  />
                </td>
                <td>
                  <p class="table__description">
                    Молоток – это инструмент, использующийся каменщиками для того, чтобы придавать
                    камням правильную геометрическую форму. Ударами молотка стесываются острые углы,
                    камень ‘облагораживается’, из ‘дикого камня’, становится камнем пригодным для
                    строительства. Молоток является символом облагораживания и другого камня –
                    Человека. Лишь совершенный камень может быть положен фундамент или в стену
                    храма. Совершенные камни, камни правильной формы всегда похожи друг на друга.
                    Только дикие, первозданные камни могут иметь бесконечное разнообразие форм.
                    Такие камни не лишены своебразной красоты и эстетики, однако с масонской точки
                    зрения это эстетика профанского мира. Здесь уместно отметить, что слово профан
                    для масона не содержит никакого негативного оттенка. Применительно к человеку
                    оно всего лишь означает, что он немасон. Таким образом для масона мир
                    символически разделен на масонов и профанов. Профанские ценности, профанская
                    жизнь – все то, что происходит за пределами храма и вне ритуальных работ. У
                    каждого масона естественно есть своя профанская жизнь. И масонство ни в коем
                    случае не преуменьшает ее ценности и значимости.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/007.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/007.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Камень грубый, камень совершенный</h3>
                  <p class="table__description">
                    Рядом с колонной Б:. либо по левую сторону от Алтаря при открытии ритуальных
                    работ ложи помещается грубый камень. Рядом с колонной Я:. или справа от альтаря
                    помещается кубический совершенный камень, готовый к закладке, использованию в
                    строительстве. Символически масонская работа состоит в том, чтобы, отесывая
                    грубый камень, улучшать непосредственное творение природы дабы удалить с него
                    шероховатости и неровности и приблизить его к форме, соответствующей его
                    назначению.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/008.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/008.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Молоток Досточтимого мастера</h3>
                  <p class="table__description">
                    Масонский молоток является еще и символом земной власти. Молоток используется
                    Досточтимым мастером Ложи, Первым стражем Ложи и Вторым стражем Ложи при
                    проведении ритуальных работ. На престоле Досточтимого мастера Ложи расположены
                    два главных инструмента – молоток и пламенеющий меч. Молоток – символ земной
                    власти, а пламенеющий меч – символ власти духовной. На плато Первого и Второго
                    стража молотки и соответственно уровень и отвес.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/009.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/009.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Отвес</h3>
                  <p class="table__description">
                    Отвес используется каменщиками для проверки вертикальности стен. Для масона
                    отвес является символом Истины. Истины не как абстрактного логического понятия,
                    а Истины как Правоты слов и дел перед Богом и обществом. Той Живой Истины, во
                    имя которой поднимались восстания и во имя которой люди горели на кострах
                    инквизиции. Отвес учит справедливости и честности в помыслах и делах и является
                    одним из подвижных сокровищ Вольного Каменщика.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/010.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/010.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Уровень</h3>
                  <p class="table__description">
                    Уровень используется каменщиками для проверки горизонтальности поверхностей.
                    Свободными Каменщиками используется как символ Равенства между людьми. Конечно,
                    В:. С:. В:. создал людей разными. Принцип равенства – отнюдь не является
                    основополагающим принципом мирового регулярного масонства. У каждого человека
                    свои таланты и способности, у каждого свои цели в жизни и взгляды, у каждого
                    свой путь. Каждый принадлежит какому-то социальному, национальному или
                    религиозному кругу. Но масонский закон должен быть един для всех людей,
                    независимо от того является ли самым богатым человеком или самым бедным, белого
                    или черного цвета его кожа, каково бы ни было его вероисповедание. Уровень –
                    символ Первого стража Ложи, второго офицера по старшинству после Досточтимого
                    мастера Ложи.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/011.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/011.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Циркуль и наугольник</h3>
                  <p class="table__description">
                    В этой эмблеме циркуль изображает Небесный Свод, а наугольник – Землю. Земля –
                    место, где человек выполняет свою работу, а Небо – символически связано с
                    местом, где чертит свой план Великий Строитель Вселенной. Циркуль, совмещенный с
                    наугольником, пожалуй, самая распространенная из всех масонских эмблем, символов
                    и знаков. Циркуль совмещается с наугольником при открытии масонских работ и
                    помещается на книге священного закона. Взаимное положение циркуля и наугольника
                    имеет для масона большое символическое значение. При открытии работ в первом
                    градусе наугольник кладется поверх циркуля, при открытии работ во втором градусе
                    один из концов циркуля освобождается, при открытии работ в третьем градусе оба
                    конца циркуля свободны. На этой эмблеме циркуль и наугольник совмещены по
                    третьему градусу. В центре эмблемы помещается буква G. Значение ее многогранно.
                    Одно из значений – сокращение от слова “геометр”. Это слово используется
                    масонами в качестве одного из названий верховного существа наряду с В:. С:. В:.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/012.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/012.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Книга Священного Закона</h3>
                  <p class="table__description">
                    Книга Священного Закона – один из трёх основных светочей Свободных Каменщиков
                    наряду с Циркулем и Наугольником. Книга священного закона – это главная книга
                    той религии, которую исповедуют присутствующие в собрании ложи братья. В случае
                    если в ложе присутствуют братья различных вероисповеданий, на престоле
                    располагается несколько книг. Чаще всего это Библия, Коран и Тора. Книга
                    священного закона олицетворяет волю В:. С:. В:. На ней масоны приносят все
                    клятвы во время посвящений и торжественных инсталляций. На книге священного
                    закона распологаются наугольник и циркуль. При этом если во время работ
                    используется несколько книг, циркуль и наугольник открывается на священной книге
                    той веры, к которой принадлежит большинство из присутствующих братьев.
                  </p>
                </td>
              </tr>
              <tr>
                <td>
                  <img
                    src="@/assets/img/symbols/013.jpg"
                    alt="Symbol 2"
                    class="table__image"
                    @click="openImageModal('symbols/013.jpg')"
                  />
                </td>
                <td>
                  <h3 class="table__title">Лучезарная Дельта</h3>
                  <p class="table__description">
                    Важнейший символ масонского храма всевидящее око или Лучезарная Дельта.
                    Лучезарная Дельта обычно располагается в восточной части храма, а по обеим
                    сторонам ее находятся Солнце (ближе к югу) и Луна (ближе к северу). Лучезарная
                    Дельта – треугольник, с помещенным внутрь него оком – знаком просвещенности или
                    принципа сознания, иначе, всевидящее око В:. С:. В:., постоянно присутствующее
                    на всех работах ложи, создающее энергетику присутствия В:. С:. В:. при
                    проведении ритуальных работ, постоянное излучение утверждение бытия.
                    Математическая точка, не имеющая размеров, но находящаяся повсюду, заполняет
                    безграничность пространства. Это также символ осознания и внимания, причем,
                    внимания взаимного, внимания которое проявляет В:. С:. В:. к каждому из братьев
                    и внимания, которое каждый брат должен проявлять по отношению к миру. Лучезарная
                    Дельта напоминает нам о том, что у каждого масона есть его собственная масонская
                    звезда, которая светит ему в трудах и направляет в поисках. Лучезарная Дельта –
                    главный масонский символ первого градуса, степени ученика.
                  </p>
                </td>
              </tr>
            </table>
          </div>
        </article>
      </div>
    </main>
    <!-- Футер -->
    <Footer />
    <!-- Кнопка для прокрутки вверх -->
    <ScrollTop />

    <!-- Модальное окно для увеличения изображения -->
    <div v-if="isModalOpen" class="modal" @click="closeImageModal">
      <img v-if="modalImageSrc" :src="modalImageSrc" alt="Full-size image" class="modal__image" />
      <p v-else class="modal__error">Изображение не удалось загрузить.</p>
    </div>
  </div>
</template>

<script setup lang="ts">
import { ref } from 'vue'

import Header from '@/components/MainHeader.vue'
import Footer from '@/components/MainFooter.vue'
import ScrollTop from '@/components/ScrollTop.vue'
import ThemeSwitcher from '@/components/ThemeSwitcher.vue'

// Реактивные переменные для модального окна
const isModalOpen = ref(false)
const modalImageSrc = ref<string | null>(null)

// Функция для открытия изображения
const openImageModal = (relativePath: string) => {
  if (relativePath) {
    try {
      modalImageSrc.value = `/src/assets/img/${relativePath}`
      isModalOpen.value = true
    } catch (error) {
      console.error('Ошибка формирования пути:', error)
      modalImageSrc.value = null
    }
  } else {
    console.error('Путь к изображению не передан!')
  }
}

// Функция для закрытия модального окна
const closeImageModal = () => {
  isModalOpen.value = false
  modalImageSrc.value = null
}
</script>

<style scoped>
@import url('https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css');
@import url('https://fonts.googleapis.com/css2?family=Baskervville:ital@0;1&family=Montserrat:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');

@import '@/assets/css/style.css';
@import '@/assets/css/article.css';

.custom-table {
  width: 100%;
  border-collapse: collapse;
  margin-top: 20px;
}

.custom-table tr {
  border: 1px solid #ccc;
}

.custom-table td {
  padding: 15px;
  vertical-align: middle;
  border: 1px solid #ccc;
}

.table__image {
  width: 150px;
  height: 150px;
  object-fit: contain; /* Изображение не обрезается */
  border-radius: 5px;
  cursor: pointer;
  transition: transform 0.2s ease;
}

.table__image:hover {
  transform: scale(1.05);
}

.table__title {
  font-size: 1.2rem;
  margin: 0 0 5px;
}

.table__description {
  font-size: 1rem;
  color: #555;
}

/* Стили модального окна */
.modal {
  position: fixed;
  top: 0;
  left: 0;
  width: 100vw;
  height: 100vh;
  background-color: rgba(0, 0, 0, 0.8);
  display: flex;
  align-items: center;
  justify-content: center;
  z-index: 1000;
  cursor: zoom-out;
}

.modal__image {
  max-width: 90%;
  max-height: 90%;
  border-radius: 5px;
}

.modal__error {
  color: white;
  font-size: 1.2rem;
  text-align: center;
}
</style>
