<template>
  <div>
    <!-- Хедер -->
    <ThemeSwitcher />
    <Header />
    <!-- Main content -->
    <main class="main">
      <div class="container">
        <article class="content-container">
          <header>
            <div class="content-category">МАСОНСТВО</div>
            <h1 class="content-title">Правда/неправда о масонстве</h1>
          </header>

          <img src="@/assets/img/truth.webp" alt="Article image" class="article__image" />

          <h2 class="content-subtitle">
            Масонство – собрание стариков? Разве масонство еще не вымерло?
          </h2>
          <div class="content-text">
            <p>
              Среди масонов много людей всех возрастов, начиная с 21 года (или 18 лет в зависимости
              от юрисдикции). Масонами являются миллионы людей в мире и сотни в России. Духовный и
              нравственный свет масонства не погас и привлекает людей, которые ищут свое место в
              мире, ищут место Человека перед Богом. В качестве дополнения можно добавить, что почти
              половина братьев, посвященных в масоны в России в 1999 г., моложе 30 лет.
            </p>
          </div>
          <h2 class="content-subtitle">Масоны расисты или элитаристы?</h2>
          <div class="content-text">
            <p>
              Масонство декларирует равенство людей независимо от их цвета кожи, вероисповедания,
              нации, социального происхождения и общественного положения. Масонство не только
              декларирует, но и исповедует этот принцип. Среди братьев есть люди всех рас и наций.
              Никогда доступ человека в Ложу не может быть ограничен по национальным или расовым
              критериям. Во многом принцип равенства людей распространился в мире благодаря ордену
              вольных каменщиков.
            </p>
            <p>
              Элитаризм – довольно трудный для определения термин. Если Вы имеете в виду вопрос,
              предъявляет ли масонство к своим членам жесткие требования, то ответ – да. Требования
              эти всем известны и четко декларированы орденом: вера в Бога и исполнение его Заветов,
              высокое духовное и нравственное развитие, постоянная забота о ближних, непреклонная
              верность идеалам семьи и государству. Большинство ли людей удовлетворяет этим
              требованиям? Если Вы считаете, что нет, то масонство элитарно.
            </p>
            <p>
              Слухи о том, что масонство открыто только для “высших классов”, для бизнесменов и
              политиков высокого ранга неверны. Источник этих слухов – ложные представления о целях
              масонства, необоснованные подозрения в стремлении ордена к мировому господству.
            </p>
          </div>
          <h2 class="content-subtitle">Ложа – место для ведения бизнесменами общих дел?</h2>
          <div class="content-text">
            <p>
              Нет. Более того, большинство масонов считают, что предпочтение в ведении дел,
              оказываемое кому-либо вследствие того, что он масон, является немасонским деянием.
              Человек, пытающийся стать масоном из-за того, что он надеется получить от этого
              экономическую или политическую выгоду, никогда не станет масоном.
            </p>
            <p>
              Если Вас интересуют организации или товарищества, созданные для совместного ведения
              дел, рекомендуем вступить в Ротари-клуб.
            </p>
          </div>
          <h2 class="content-subtitle">
            В масонстве употребляются титулы “Досточтимый Мастер” и др. Масонство это секта или
            какая-то религиозная организация?
          </h2>
          <div class="content-text">
            <p>
              Нет. Титулы, используемые в масонстве просто исполнены красоты, величия, древнего
              символизма. И они сохраняются вследствие этих причин, однако не несут в себе смысла
              поклонения их обладателям, или признания за ними светской власти над прочими членами
              Братства. То, что брат является Досточтимым Мастером или кем-то еще говорит только о
              его роли в обрядах масонства и может в административном управлении Орденом. Достижение
              степени человеком придает ему авторитет, ведь масонство очень щепетильно и строго в
              установлении соответствия достоинств брата и их официальном признании.
            </p>
            <p>
              Масонство содержит множество механизмов для предотвращения от перерождения в секту.
              Одним из важных принципов масонства является постоянная ротация руководящих
              должностных лиц. Так, руководитель ложи, Досточтимый мастер, не может занимать эту
              должность более 3 лет подряд.
            </p>
          </div>
          <h2 class="content-subtitle">
            Масонство – секретная организация? Что является масонским секретом, а о чем можно
            говорить публично?
          </h2>
          <div class="content-text">
            <p>
              Масонство не скрывает факта своего существования. Отдельные ложи тоже не скрывают
              факта своего существования. Например, в российской Сети вы можете найти названия почти
              всех российских лож, работающих под юрисдикцией Объединенной Великой Ложи России. Со
              временем многие из них будут отдельно представлены на нашем сайте.
            </p>
            <p>
              В то же время, глубоко личные вопросы, связанные со сферой духовного
              совершенствования, братья считают неуместным обсуждать публично. Эта позиция достойна,
              по меньшей мере, понимания. По нашим традициям, каждый брат вправе без всяких
              согласований заявить о своей принадлежности к Ордену. Однако он не вправе назвать
              имена других членов Ордена, не получив от них прямого согласия.
            </p>
            <p>
              Пока в России масоны не могут так широко и открыто говорить о своей принадлежности к
              организации, как в США или в Европе. Это последствие негативного отношения к Ордену
              небольшой, но крайне агрессивной части наших сограждан. Мы также помним о том, что
              имеем большой опыт преследований со стороны властей. Кроме списков членов ордена,
              секрет представляют масонские ритуалы, тайные слова, опознавательные знаки.
            </p>
          </div>
          <h2 class="content-subtitle">Почему масонские ритуалы секретны?</h2>
          <div class="content-text">
            <p>
              Процесс посвящения имеет эзотерическую сторону. С ритуалом каждого градуса брат
              знакомится только в момент посвящения в этот градус. Так, от посвящения достигается
              максимальный эффект. Это дает материал для глубоких размышлений, создает внутреннее
              духовное напряжение.
            </p>
          </div>
          <h2 class="content-subtitle">Масонство – религия?</h2>
          <div class="content-text">
            <p>
              Нет. Масонство требует от своих членов веры в Бога. Но масонство не заставляет
              человека придерживаться определенной веры, не навязывает ему какой-либо собственной
              системы исполнения религиозных обрядов и не требует даже определенной конфессиональной
              принадлежности.
            </p>
            <p>
              Все ритуалы масонства и его символика – средства духовного усовершенствования
              человека, но мы избегаем суждений о Боге. Такие суждения для брата определяются
              конфессиональной принадлежностью (если она есть) либо внутренним духовным чувством.
              Орден лишь способствует раскрытию внутренней религиозности человека, укрепляет его
              веру, делая ее более глубокой и искренней. Но в личные религиозные убеждения масонство
              не привносит какой-либо окраски.
            </p>
          </div>
          <h2 class="content-subtitle">
            Но вы же считаете Великого Архитектора Вселенной своим Богом?
          </h2>
          <div class="content-text">
            <p>
              Всё как раз наоборот. Мы Бога называем Великим Архитектором Вселенной, так как Он
              сотворил всё сущее. Вам, вероятно, приходилось слышать, как Его называли Творцом.
              Согласитесь, есть разница: Бога считать Строителем или строителя – богом!
            </p>
          </div>
          <h2 class="content-subtitle">Масоны контролируют мир?</h2>
          <div class="content-text">
            <p>
              Нет. Авторы, выдвигающие подобные тезисы, нуждаются в немедленной помощи психиатра.
              Рекомендуем Вам прочитать “Маятник Фуко” Умберто Эко. В этой книге, в частности,
              показывается как люди доходят до таких психических отклонений. Этот тезис совершенно
              несерьезен. Поэтому он здесь особо не рассматривается. Также здесь не рассматриваются
              тезисы авторов, подобных С. А. Нилусу, Лео Таксилю, О. Платонову о том, что масоны
              якобы поклоняются сатане, что он в виде козла присутствует на каждом собрании ложи и
              постоянно бьет молотком по столу и т. д.. Репутация таких людей является лучшим
              опровержением всего, что ими написано. Работы этих людей полны намеренных
              фальсификаций. Опубликованные в этих работах “списки российских масонов” – абсолютная
              ложь. Опубликованные там масонские ритуалы на девять десятых ложь.
            </p>
          </div>
          <h2 class="content-subtitle">Масонские ритуалы унизительны для кандидата?</h2>
          <div class="content-text">
            <p>
              Нет. Нет ничего более далекого от правды. Цель ритуалов – научить человека
              добродетелям масонства и это не может быть достигнуто средствами унижения. Наши
              ритуалы очень красивы и полны символизма. Их происхождение осенено славой великих
              мистерий различных религий многих народов Земли на протяжении всей ее истории, с той
              только поправкой, что современные масонские обряды никоим образом не угрожают жизни,
              физическому и душевному здоровью, чести и достоинству кандидата и его близких.
            </p>
          </div>
          <h2 class="content-subtitle">За последнее время масонские ритуалы упростились?</h2>
          <div class="content-text">
            <p>
              Объединённая Великая Ложа России использует ритуалы, которые в основе своей
              практически не менялись последние сто лет. Ряд юрисдикций, прежде всего в США,
              использует упрощенные ритуалы. В большей степени это относится к степеням Шотландского
              Устава.
            </p>
          </div>
          <h2 class="content-subtitle">
            Масоны называют здания, принадлежащие им Храмами. Там совершаются обряды религиозного
            поклонения?
          </h2>
          <div class="content-text">
            <p>
              Нет. По определению многих словарей, Храм – это здание, служащее для специальных целей
              какой-либо организации. Например, для проведения заседаний Ложи. Кроме того, по
              ритуалу Ложа символически заседает на месте строительства Иерусалимского Храма, то
              есть до его освящения, следовательно, он еще, строго говоря, не является религиозным
              сооружением.
            </p>
          </div>
          <h2 class="content-subtitle">
            Масоны контролируют трехстороннюю комиссию или она контролирует их? Связанно ли
            Масонство с Билдербергской конференцией?
          </h2>
          <div class="content-text">
            <p>
              Трехсторонняя комиссия. Создана в 1973. Три ведущих индустриальных образования в мире
              – Европейский Союз, Северная Америка (США и Канада), Япония – формируют ее. Членами
              комиссии являются 330 граждан этих стран, отличившихся в бизнесе, науке, политике (но
              не в правительственных организациях), в средствах массовой информации.
            </p>
            <p>
              Вся комиссия собирается один раз в год. Во время собрания рассматриваются вопросы
              имеющие жизненно важную силу для регионов охватываемых комиссией.
            </p>
            <p>
              Ни организаторы комиссии, ни ее текущий административный состав не были и не являются
              масонами.
            </p>
            <p>
              Билдербергская конференция cоздана Принцем Бернардом в 1954 году в Остербеке,
              Нидерланды. Ежегодная трехдневная конференция, в которой участвуют около 100 банкиров,
              экономистов, политиков, правительственных чиновников. Участники избираются комитетом
              комиссии в Гааге.
            </p>
            <p>
              Представление о работе комиссии может дать следующий документ: A public statement by
              the Bilderberg Conference. Эта комиссия также никак не связана с масонством.
            </p>
          </div>
        </article>
      </div>
    </main>
    <!-- Футер -->
    <Footer />
    <!-- Кнопка для прокрутки вверх -->
    <ScrollTop />
  </div>
</template>

<script setup lang="ts">
import Header from '@/components/MainHeader.vue'
import Footer from '@/components/MainFooter.vue'
import ScrollTop from '@/components/ScrollTop.vue'
import ThemeSwitcher from '@/components/ThemeSwitcher.vue'
</script>

<style scoped>
@import url('https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css');
@import url('https://fonts.googleapis.com/css2?family=Baskervville:ital@0;1&family=Montserrat:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');

@import '@/assets/css/style.css';
@import '@/assets/css/article.css';
</style>
