<template>
  <div>
    <!-- Хедер -->
    <ThemeSwitcher />
    <Header />
    <!-- Main content -->
    <main class="main">
      <div class="container">
        <article class="content-container">
          <header>
            <h1 class="content-title">ПРИВЕТСТВИЕ</h1>
          </header>

          <img src="@/assets/img/ovlr.jpg" alt="Article image" class="article__image" />

          <div class="content-text">
            <p>
              Добро пожаловать на официальный сайт Масонской Ложи «А.С. Пушкин», работающей на Востоке городов Барселоны и Парижа! Наша Ложа уникальна: она является единственной русскоязычной масонской мастерской за пределами России, объединяющей Братьев, живущих или временно находящихся вдали от своей Родины.
            </p>

            <p>
              Ложа «А.С. Пушкин», основанная 1 мая 1991 года в Париже в составе Великой Ложи Франции, имеет богатую историю. С сентября 2020 года она является частью Объединенной Великой Ложи России 1921 года, продолжая традиции русских масонских лож, действовавших во Франции. В наши дни мы ведем работы по Древнему и Принятому Шотландскому Уставу – одному из старейших масонских ритуалов, который способствует гармоничному развитию личности и укреплению духовного единства.
            </p>

            <p>
              Мы обращаемся не только к профанам, которые ищут свой путь к Свету, но и к Братьям из других масонских послушаний, оказавшимся вдали от своих Лож. Если вы ищете русскоязычное масонское сообщество за пределами России, где можно продолжить участие в ритуальной и духовной жизни, наша Ложа – именно то место, где вы найдете поддержку и единомышленников.
            </p>

            <p>
              Братья Ложи – мужчины свободные и добрых нравов – следуют идеалам самосовершенствования и благотворительности. Наши труды основаны на уважении к разнообразию взглядов, свободе дискуссий и стремлении к взаимопониманию, избегая раздоров и споров. Мы считаем, что масонство – это путь к внутреннему развитию и служению обществу.
            </p>

            <p>
              Масонство – явление глубокое и многогранное. К сожалению, в популярной культуре оно часто окружено мифами и домыслами. Мы приглашаем вас ознакомиться с достоверной информацией о нашей Ложе, её истории и философии, представленной на этом сайте. Если вас интересуют вопросы о том, что такое масонство, каковы его цели и как к нему присоединиться, то вы находитесь в нужном месте.
            </p>

            <p>
              Мы надеемся, что материалы нашего сайта будут полезны вам в ваших духовных исканиях и помогут открыть новые горизонты на пути к Свету. Помните, двери масонского Храма всегда открыты для тех, кто искренне ищет истину, стремится к улучшению мира и готов соблюдать традиции Масонского Ордена.
            </p>

            <p>
              Пусть Великий Архитектор Вселенной направляет вас в ваших поисках и ведёт к Истине!
            </p>
          </div>
        </article>
      </div>
    </main>
    <!-- Футер -->
    <Footer />
    <!-- Кнопка для прокрутки вверх -->
    <ScrollTop />
  </div>
</template>

<script setup lang="ts">
import Header from '@/components/MainHeader.vue'
import Footer from '@/components/MainFooter.vue'
import ScrollTop from '@/components/ScrollTop.vue'
import ThemeSwitcher from '@/components/ThemeSwitcher.vue'
</script>

<style scoped>
@import url('https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css');
@import url('https://fonts.googleapis.com/css2?family=Baskervville:ital@0;1&family=Montserrat:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900&display=swap');

@import '@/assets/css/style.css';
@import '@/assets/css/article.css';
</style>
