<template>
  <div>
    <!-- Хедер -->
    <ThemeSwitcher />
    <Header />
    <!-- Main content -->
    <main class="main">
      <div class="container">
        <article class="content-container">
          <header>
            <h1 class="content-title">ОВЛР</h1>
          </header>

          <img src="@/assets/img/ovlr.jpg" alt="Article image" class="article__image" />

          <div class="content-text">
            <div class="entry-content herald-entry-content">
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 18pt"
                  ><strong>Объединённая Великая Ложа России</strong></span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Революционные события 1917 года и последовавшая затем Гражданская война заставили
                  миллионы бывших подданных России покинуть Родину. Одним из центров русской
                  эмиграции стала Франция. Оказавшиеся за рубежом братья сразу же начинают
                  формировать русские масонские структуры в изгнании.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >К слову, масоны всего мира называют себя братьями, а общество – братством, этими
                  терминами мы и пользуемся далее. Братья, выходцы из России, изначально планировали
                  создание в Париже полноценной структуры русского масонства – символических лож под
                  эгидой Великой Ложи и Верховного Совета, с целью последующего переноса их работ в
                  Россию. Необходимо пояснить, что символические ложи под эгидой Великой Ложи
                  объединяют братьев трех первых степеней посвящения, а Верховный Совет управляет
                  ложами остальных высших степеней посвящения.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Выбор российских масонов в пользу Верховного Совета Франции (и связанной с ним
                  Великой Ложи Франции) был обусловлен тем, что он был материнской организацией для
                  структуры высших градусов Древнего и Принятого Шотландского Устава в Европе и
                  долгое время являлся символом универсальности масонства.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >В конце 1980-х – начале 1990-х годов начался процесс возрождения масонства в
                  России. Под эгидой Великого Востока Франции 28 апреля 1991 года в Москве была
                  открыта первая масонская ложа «Северная Звезда». Всего ВВФ было открыто в России
                  шесть лож. В этот же период ложи в России начала открывать и Великая Ложа Франции:
                  в Москве – «Николай Новиков» (30 августа 1991) и «Лютеция» (30 октября 1993); в
                  Санкт-Петербурге – «Сфинкс» (30 августа 1992).</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >А после уже и под эгидой Великой Национальной Ложи Франции в Париже, с
                  последующим «переездом» в Москву, создается ложа «Гармония» (14 января 1992),
                  через полтора года (24 июня 1993) в Санкт-Петербурге учреждается ложа «Астрея», в
                  Воронеже – «Гамаюн»; а в Москве – «Лотос» (12 октября 1993).</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >И вот после 15 лет, после некоторых событий, неизбежных в период роста, сначала 4
                  сентября 2008 года был создан Верховный Совет Российской Федерации, и 11 октября
                  2008 года, на своей торжественной ассамблее, прошедшей под патронатом Великой Ложи
                  Франции, была учреждена&nbsp;<a
                    href="https://ru.wikipedia.org/wiki/%D0%9E%D0%B1%D1%8A%D0%B5%D0%B4%D0%B8%D0%BD%D1%91%D0%BD%D0%BD%D0%B0%D1%8F_%D0%B2%D0%B5%D0%BB%D0%B8%D0%BA%D0%B0%D1%8F_%D0%BB%D0%BE%D0%B6%D0%B0_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8"
                    data-wpel-link="external"
                    target="_blank"
                    rel="nofollow external noopener noreferrer"
                    >Объединённая Великая Ложа России</a
                  >&nbsp;(ОВЛР), которой был выдан патент Великой ложи Франции на право проведения
                  работ по Древнему и Принятому Шотландскому Уставу, куда при учреждении вошли 11
                  лож.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >29 марта 2009 года делегация Верховного совета Франции (второго по старшинству в
                  мире – создан 22 сентября 1804 года) во главе с Великим Командором провела
                  торжественную инсталляцию Верховного Совета Российской Федерации. И уже 17 декабря
                  2009 года Верховный Совет РФ был принят в Международный Альянс Верховных Советов
                  ДПШУ под символичным номером «33», а также стал членом Панъевропейской Ассоциации
                  Верховных Советов.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Тесное десятилетнее сотрудничество, совместная продуктивная работа в
                  международных структурах позволили Верховному Совету Франции принять обоснованное
                  решение о передаче Верховному Совету Российской Федерации полной преемственности
                  от Русского Совета 33-й степени, и тем самым завершить исполнение возложенной на
                  Верховный Совет Франции исторической миссии по возвращению русского масонства
                  высших степеней в Россию. Официальный Акт об этом событии был подписан на
                  Торжественном собрании Международного Альянса Верховных Советов ДПШУ в Париже 13
                  декабря 2019 года. Вот что, в частности, сказано в этом документе.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >«Декретом Верховного Совета Франции от 13 декабря 2019 года Верховному Совету
                  Российской Федерации была передана прямая преемственность от Русского Совета 33-й
                  степени, работающего во Франции в 1936–1962 годах, и предоставлено право
                  именоваться «Верховный Совет Российской Федерации 1936»».</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Ложи, работающие под сенью Объединенной Великой Ложи России, продолжили традиции
                  многовековой истории российского масонства и русских Лож, работавших ранее и
                  продолжающих работать как в России, так и за ее пределами, и получившими в разное
                  время Свет от Великой Английской Ложи Франции, созданной в 1728 году и
                  переименованной в 1895 году в Великую Ложу Франции. На сегодняшний день в
                  Объединенной Великой Ложе России работает 28 лож.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Как результат, решением федерального Совета Великой Ложи Франции 23 июля 2020
                  года был единогласно принят Декрет, объявляющий прямую линию происхождения
                  Объединенной Великой Ложи России от русскоязычных лож Великой Ложи Франции и право
                  преемственности с предоставлением законного титула – «Объединенная Великая Ложа
                  России 1921»</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Тем самым была завершена историческая миссия Великой Ложи Франции и Верховного
                  Совета Франции по сохранению, развитию в эмиграции и возвращению в Россию русского
                  масонства.</span
                >
              </p>
              <p style="text-align: justify">
                <span style="font-family: 'book antiqua', palatino, serif; font-size: 14pt"
                  >Таким образом, в 2021 году русское традиционное масонство отмечло два юбилейных
                  события: 100-летие Великой Ложи и 85-летие Верховного Совета, чему было посвящено
                  несколько официальных международных мероприятий и пресс-конференций.</span
                >
              </p>
              <p style="text-align: justify">&nbsp;</p>
            </div>
          </div>
        </article>
      </div>
    </main>
    <!-- Футер -->
    <Footer />
    <!-- Кнопка для прокрутки вверх -->
    <ScrollTop />
  </div>
</template>

<script setup lang="ts">
import Header from '@/components/MainHeader.vue'
import Footer from '@/components/MainFooter.vue'
import ScrollTop from '@/components/ScrollTop.vue'
import ThemeSwitcher from '@/components/ThemeSwitcher.vue'
</script>

<style scoped>
@import url('https://cdnjs.cloudflare.com/ajax/libs/normalize/8.0.1/normalize.min.css');
@import url('https://fonts.googleapis.com/css2?family=Baskervville:ital@0;1&family=Montserrat:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;0,800;0,900;1,100;1,200;1,300;1,400;1,500;1,600;1,700;1,800;1,900&display=swap');

@import '@/assets/css/style.css';
@import '@/assets/css/article.css';
</style>
